init-mod-magit.org
* magit (~init-mod-magit.el~)
:PROPERTIES:
:header-args: :tangle   lisp/init-mod-magit.el
:END:

| ~F9~ | See git status. |

In the status buffer:
| ~s~     | Stage files.                                               |
| ~c c~   | Commit (type the message then C-c C-c to actually commit). |
| ~b b~   | Switch to another branch.                                  |
| ~P P~   | Push.                                                      |
| ~F F~   | Pull.                                                      |
| ~<tab>~ | ?                                                          |

[[https://github.com/magit/magit][Magit]] is a front end for the Git version control system.
#+BEGIN_SRC emacs-lisp
(require 'magit)
#+END_SRC

Disable warning on new magit behavior. Before running Git, Magit by default reverts all unmodified
buffers that visit files tracked in the current repository.
#+BEGIN_SRC emacs-lisp
(setq magit-last-seen-setup-instructions "1.4.0")
#+END_SRC


Automatically kill all magit buffers after push.
#+BEGIN_SRC emacs-lisp
  (defun is-magit-buffer (buffer)
    (let ((name (buffer-name buffer)))
      (and (= ?* (aref name 0))
           (not (string-match "^\\*magit\\*" name)))))
 
  (defun kill-magit-buffers ()
    (interactive)
    (loop for buffer being the buffers
          do (and (is-magit-buffer buffer) (kill-buffer buffer))))

  (defun magit-quit-session ()
    "Kill magit buffers and reduce current window"
    (interactive)
    (kill-magit-buffers)
    (delete-window-switch-previous))
        
  (define-key magit-status-mode-map (kbd "q") 'magit-quit-session)
#+END_SRC

Convenient key binding for magit-status.
#+BEGIN_SRC emacs-lisp
(global-set-key [f9] 'magit-status)
#+END_SRC

Push after commit.
#+BEGIN_SRC emacs-lisp
(add-hook 'git-commit-setup-hook
          (lambda ()
            (add-hook 'with-editor-post-finish-hook
                      (lambda ()
                        (call-interactively #'magit-push-current-to-upstream))
                      t t)))
#+END_SRC
